# Содержимое файла
# На вход программе подается строка с именем текстового файла. Напишите программу,
# которая выводит на экран его содержимое.

# Формат входных данных
# На вход программе подается строка текста с именем существующего текстового файла.

# Формат выходных данных
# Программа должна вывести содержимое указанного файла.

# Примечание 1. Считайте, что исполняемая программа и указанный файл находятся в
# одной папке.

# Примечание 2. Не забудьте закрыть файл 🙂.

file_name = input()

with open(file_name, 'r', encoding='utf-8') as f:
    result = f.read()
    print(result)



# Предпоследняя строка
# На вход программе подается строка с именем текстового файла. Напишите программу,
# которая выводит на экран его предпоследнюю строку.

# Формат входных данных
# На вход программе подается строка текста с именем существующего текстового файла.

# Формат выходных данных
# Программа должна вывести предпоследнюю строку указанного файла.

# Примечание 1. Считайте, что исполняемая программа и указанный файл находятся в одной
# папке.

# Примечание 2. Гарантируется, что файл содержит хотя бы две строки.

# Примечание 3. Не забудьте закрыть файл 🙂.

file_name = input()

with open(file_name, 'r', encoding='utf-8') as f:
    print(f.readlines()[-2])



# Случайная строка
# Вам доступен текстовый файл lines.txt из нескольких строк. Напишите программу,
# которая выводит на экран случайную строку из этого файла.

# Формат входных данных
# На вход программе ничего не подается.

# Формат выходных данных
# Программа должна вывести случайную строку указанного файла.

# Примечание 1. Считайте, что исполняемая программа и указанный файл находятся в
# одной папке.

# Примечание 2. Гарантируется, что файл содержит хотя бы одну строку.

# Примечание 3. Не забудьте закрыть файл 🙂.

from random import *

with open('lines.txt', 'r', encoding='utf-8') as lines:
    print(lines.readlines()[randint(0, len(lines.readlines()))])



# Сумма двух-1
# Вам доступен текстовый файл numbers.txt из двух строк, на каждой из них записано целое
# число. Напишите программу, выводящую на экран сумму этих чисел.

# Формат входных данных
# На вход программе ничего не подается.

# Формат выходных данных
# Программа должна вывести сумму чисел из указанного файла.

# Примечание 1. Считайте, что исполняемая программа и указанный файл находятся в одной
# папке.

# Примечание 2. Не забудьте закрыть файл 🙂.

with open('numbers.txt', 'r', encoding='utf-8') as numbers:
    total = 0
    for line in numbers:
        total += int(line)
    print(total)



# Сумма двух-2
# Вам доступен текстовый файл nums.txt. В файле записано два целых числа, они могут
# быть разделены символами пробела и конца строки. Напишите программу, выводящую на
# экран сумму этих чисел.

# Формат входных данных
# На вход программе ничего не подается.

# Формат выходных данных
# Программа должна вывести сумму чисел из указанного файла.

# Примечание 1. Считайте, что исполняемая программа и указанный файл находятся в одной
# папке.

# Примечание 2. Не забудьте закрыть файл 🙂.

with open('nums.txt', 'r', encoding='utf-8') as nums:
    nums_list = nums.read().split()
    print(sum(map(int, nums_list)))



# Общая стоимость
# Вам доступен текстовый файл prices.txt с информацией о заказе из интернет магазина.
# В нем каждая строка с помощью символа табуляции (\t) разделена на три колонки:

# наименование товара;
# количество товара (целое число);
# цена (в рублях) товара за 1 шт (целое число).
# Напишите программу, выводящую на экран общую стоимость заказа.

# Формат входных данных
# На вход программе ничего не подается.

# Формат выходных данных
# Программа должна вывести общую стоимость заказа.

# Примечание 1. Считайте, что исполняемая программа и указанный файл находятся в одной
# папке.

# Примечание 2. Не забудьте закрыть файл 🙂.

with open('prices.txt', 'r', encoding='utf-8') as prices:
    price = 0
    for product in prices:
        product = product.split()
        price += int(product[1]) * int(product[2])
    print(price)